{
  "roles": [
    {
      "role_name": "Party A",
      "narrative": "You and one of your roommates made a pact at graduation to take a trip together. Eight years have passed, and that trip still has not happened. You have stayed in touch, but you can feel yourselves slowly drifting apart. Now you are determined to plan a weekend vacation together as a way to reconnect. You also know that you both want something a little different from this trip, and whether it happens at all will depend on whether you can reach an agreement in spite of these differences.\n\nYou like a relaxed pace when you travel. You do not enjoy feeling rushed or squeezed by a tight schedule, and you would rather have a few slow and meaningful moments than try to do everything. You also prefer calm evenings. After a full day, you like having time to wind down at night rather than keeping the energy going. You feel happiest when you are sharing the trip experience together, rather than splitting off and doing your own thing most of the time. You would rather stay close to nature, so the weekend feels calmer and more refreshing. Being near the mountains helps the trip feel like a real break. When you imagine the ideal weekend, you do not care much what the main activity is, as long as the overall rhythm feels relaxed and enjoyable.\n\nAbout your friend:\nYou realize that your friend may have very different preferences from you. They may want a faster pace with packed days, they may enjoy busy evenings and nightlife, and they may want more personal space even though you have not seen each other properly in years. They may also be more excited about a city-focused Sunday than being outdoors, and they may not care as much as you do about staying close to nature. It has been eight years since you lived together, and a lot has changed, so whatever you remember about their travel style might no longer be accurate. You know you will have to listen carefully and rediscover what matters to them during the conversation, while still trying to advocate for the things that matter most to you.\n\nYour task:\nYou already have a rough plan to visit a city with both a nearby mountain range and a lively urban center. But a couple of things on your itinerary remain undecided, which includes Sunday’s group activity. You and your friend have decided to hop on a video call to agree on the finer details of what to include or leave out of your plans, and you have narrowed it down to a discussion of ten issues. Below are your preferences for each one. Higher points mean greater satisfaction for you on that issue.\n\nImportantly, the two of you are a unit, so this trip is all-or-nothing: if you cannot agree on a plan, you would rather spend the week visiting your parents back home, which costs almost nothing and still feels like a proper break. Visiting your parents is worth zero points, so you will only agree to this vacation if you can find a plan that gives you a positive score.",
      "BATNA": "Your best alternative to negotiated agreement ('BATNA') is to visit your parents, which is worth 0 points.",
      "RP": 0,
      "scoresheet": {
        "Slow_mornings": [
          {
            "option": "Include",
            "score": 0.75,
            "reason": "Keeps the pace relaxed"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Multiple_activities_per_day": [
          {
            "option": "Include",
            "score": -1.43,
            "reason": "Too rushed; you want a lighter pace"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Calm_nights_in": [
          {
            "option": "Include",
            "score": 0.96,
            "reason": "Helps you wind down at night"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Enjoy_nightlife": [
          {
            "option": "Include",
            "score": -1.2,
            "reason": "Too late and draining"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Shared_rooms": [
          {
            "option": "Include",
            "score": 0.98,
            "reason": "More bonding time"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Separate_rooms": [
          {
            "option": "Include",
            "score": -1.61,
            "reason": "Feels too separate from the group"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Cabin_near_mountains": [
          {
            "option": "Include",
            "score": 0.31,
            "reason": "Being near nature makes the weekend feel like a real break"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Hotel_in_city": [
          {
            "option": "Include",
            "score": -1.81,
            "reason": "Less calm than staying near nature"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Sunday_hiking": [
          {
            "option": "Include",
            "score": 0.0,
            "reason": "No strong preference"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Sunday_city_exploration": [
          {
            "option": "Include",
            "score": 0.0,
            "reason": "No strong preference"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ]
      }
    },
    {
      "role_name": "Party B",
      "narrative": "You and one of your roommates made a pact at graduation to take a trip together. Eight years have passed, and that trip still has not happened. You have stayed in touch, but you can feel yourselves slowly drifting apart. Now you are determined to plan a weekend vacation together as a way to reconnect. You also know that you both want something a little different from this trip, and whether it happens at all will depend on whether you can reach an agreement in spite of these differences.\n\nYou like a fast pace when you travel. You do not enjoy feeling like the day was wasted, and you would rather fit in many experiences than slow things down too much. You also prefer busy evenings. You enjoy going out at night when there is something happening, and you like the trip to still feel alive after dinner. You feel happiest when you have enough personal space to move at your own rhythm, even while sharing a trip with someone else. You do not care much where you stay, as long as it works for the plans. You are more focused on what you do than the exact location. When you imagine the ideal weekend, you picture exploring the city and discovering new places in a way that feels exciting and full.\n\nAbout your friend:\nYou realize that your friend may have very different preferences from you. They may want a slower pace, they may prefer calm nights in, and they may care more about doing things together rather than building in personal space. They may also care a lot about staying close to nature, even if you do not see that as the main priority. And since it has been eight years since you lived together, you know your memory of their travel style might be off. You will need to listen carefully during the conversation to figure out what matters most to them, while still trying to advocate for the kind of weekend you want.\n\nYour task:\nYou already have a rough plan to visit a city with both a nearby mountain range and a lively urban center. But a couple of things on your itinerary remain undecided, which includes Sunday’s group activity. You and your friend have decided to hop on a video call to agree on the finer details of what to include or leave out of your plans, and you have narrowed it down to a discussion of ten issues. Below are your preferences for each one. Higher points mean greater satisfaction for you on that issue.\n\nImportantly, the two of you are a unit, so this trip is all-or-nothing: if you cannot agree on a plan, you would rather spend the week visiting your parents back home, which costs almost nothing and still feels like a proper break. Visiting your parents is worth zero points, so you will only agree to this vacation if you can find a plan that gives you a positive score.",
      "BATNA": "Your best alternative to negotiated agreement ('BATNA') is to visit your parents, which is worth 0 points.",
      "RP": 0,
      "scoresheet": {
        "Slow_mornings": [
          {
            "option": "Include",
            "score": -1.39,
            "reason": "Feels too slow; you want more momentum"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Multiple_activities_per_day": [
          {
            "option": "Include",
            "score": 0.45,
            "reason": "Packed days feel worth it"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Calm_nights_in": [
          {
            "option": "Include",
            "score": -0.58,
            "reason": "Too quiet; you want more nightlife"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Enjoy_nightlife": [
          {
            "option": "Include",
            "score": 0.06,
            "reason": "Nightlife is part of the fun"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Shared_rooms": [
          {
            "option": "Include",
            "score": -1.45,
            "reason": "Too little privacy"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Separate_rooms": [
          {
            "option": "Include",
            "score": 1.91,
            "reason": "Privacy helps you recharge"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Cabin_near_mountains": [
          {
            "option": "Include",
            "score": 0.0,
            "reason": "No strong preference"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Hotel_in_city": [
          {
            "option": "Include",
            "score": 0.0,
            "reason": "No strong preference"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Sunday_hiking": [
          {
            "option": "Include",
            "score": -0.93,
            "reason": "Not your vibe; you prefer city time"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Sunday_city_exploration": [
          {
            "option": "Include",
            "score": 0.44,
            "reason": "City exploring feels exciting"
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ]
      }
    }
  ],
  "tips": "<p class=\"text-gray-700 mb-4\">Negotiation is a skill that can be learned and improved with practice. At its core, negotiation is about making choices under conditions of <strong>interdependence</strong>: two or more parties want something, and each party's success depends, at least in part, on the decisions of the others. While the art of negotiation can seem daunting, there are several fundamental concepts that provide a foundation for effective bargaining. Understanding these concepts can help negotiators achieve better outcomes and avoid common pitfalls.</p><p>One of the most important ideas in negotiation is the concept of <strong>BATNA</strong> and <strong>reservation price</strong>. BATNA stands for \"Best Alternative to a Negotiated Agreement.\" It is essentially your fallback option—the \"thing\" you will pursue if the current negotiation fails. Your BATNA is not just abstract; it is the concrete alternative that protects you from agreeing to a deal that leaves you worse off than your options outside the negotiation. Closely related is the <strong>reservation price</strong>, which is the value of your BATNA quantified. It represents the minimum acceptable deal you are willing to accept.</p><p>The number one rule of negotiation is simple: <strong>never accept a deal worse than your BATNA</strong>! Knowing your BATNA and reservation price gives you a clear boundary and helps prevent you from making poor concessions under pressure.</p><p class=\"text-gray-700 mb-4\">Another fundamental concept is the possibility of <strong>integrative negotiation</strong>, which is when you create value or \"expand the pie\" within a deal rather than simply dividing a fixed amount of pie. The key insight is that what matters a lot to you may matter less to someone else. By identifying these differences in priorities, negotiators can make strategic tradeoffs: conceding on issues that are low priority to gain on issues that are high priority. This approach transforms negotiation from a zero-sum battle into an opportunity for mutual gain, where both parties can walk away better off than if they had simply split the difference.</p>"
}
