{
  "roles": [
    {
      "role_name": "Party A",
      "narrative": "Back in college, you were close friends with your roommate, a tight two-person bond that lived and died together until graduation. You made a pact at graduation to take a trip together once your lives had gotten settled. Now five years have passed, and that trip still hasn't happened! Of course you’re both busy, but another challenge is finding a plan that feels exciting to both of you.\n\nAlthough you've stayed in touch and visit regularly, you can feel yourselves drifting apart, since you both ended up in different cities after graduating and have since formed new social circles. You think it's now or never: if you don't take this trip soon, you don't know when you’ll ever find the time. This trip is your chance to reconnect on a deep level, but will only happen if you can find a suitable plan.\n\n**The plan so far:**\nBroadly speaking, you share a lot of interests. This is why you're such great friends. Both of you love exploring, and neither of you has really traveled outside the USA. You both like cities with nightlife, but you also want the option to dip into nature when you feel like it. That mix is what you’ve been looking for. The solution? Barcelona. You’ve been talking for years about a visit to Barcelona, a culture-rich city that stays up late, with a mountain range on one side and the coast and long beaches on the other. It’s the kind of place that sparked the pact in the first place.\n\n**Issues under discussion:**\nHowever, the devil is in the details. Although you have a lot in common, you also are very different—you became roommates first by random lottery, and then friends later. For example, you've always liked to start your day slow: a cup of coffee and a newspaper, easing into the morning. In contrast, your roommate was always the type to jump into action.\n\nBut life is all about tradeoffs, right? You have to give a little to get a little, and you are confident that you can find a plan that works for both of you.\n\nYou’ve narrowed it down to 10 possible tweaks to the last plan. These include whether to have:\n- Slow mornings (vs early activities)\n- Multiple afternoon activities (vs just one activity)\n- Plans to meet new people (vs keeping it private)\n- Other college friends join (vs just the two of you)\n- Shared rooms (vs separate rooms)\n- Some solo activities (vs always staying together)\n- Visits to nearby towns (vs plans within the city only)\n- Hotel arrangements in the city (vs staying near the mountains)\n- A long nature excursion (vs shorter hikes only)\n- More historical tours (vs tour covering the main attractions only)\n\n*As you prepare for the negotiation, you reflect on your general preferences for each of these issues.*\n\n**Your preferences:**\nRelaxation is your favorite part of a trip. You prefer slow mornings because you like easing into the day without a clock ruining your mood. And so, by the afternoon, you want breathing room. Too many activities turns the day into a checklist.\nMeeting new people sounds fun. The best part is that those shared moments with new people turn into the kind of stories that always come up later when you two are reminiscing. However, meeting your other college friends sounds like a chore. You didn’t really like them that much, and you’d honestly rather spend time with strangers than with them.\nSharing rooms just feels right to you. You like the late-night chats and the small moments, and waking up in the same place is how the weekend actually feels like time together. You also don’t want solo activities explicitly planned. The whole purpose of this trip is to spend more time together.\nIdeally, you’d love to see some of the nearby towns. Visiting somewhere like Tarragona, or seeing the villages surrounding the mountain range feels much more exciting than only staying in the city. That’s why you’d prefer being closer to the mountains rather than the city. It’s calmer, and it’s closer to the natural park, and to the other towns you could visit.\nYou’re flexible on a long nature excursion. If your friend is excited you can go along, and if not, that’s fine too. It’s the same for the history tours. You don’t hate having more of them, but they’re not something you need to make this trip feel special.\n\n**Your Prolific Bonus ($):**\nYour preferences are captured in the points table below. Higher points mean you like that option more, and **the total points you receive *if your group reaches an agreement* will determine the amount of money you earn from Prolific.** Since it has been five years since you and your friend lived together, your memories of each other’s travel styles may be outdated, so **maximizing your total points (and earnings) requires listening carefully and rediscovering what matters to them while still advocating for what matters most to you.**",
      "BATNA": "Your best alternative to negotiated agreement ('BATNA') is to visit your parents, which is worth 0 points.",
      "RP": 0,
      "scoresheet": {
        "Slow_Mornings": [
          {
            "option": "Include",
            "score": 0.9,
            "reason": "You like relaxing travel plans."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Multiple_Afternoon_Activities": [
          {
            "option": "Include",
            "score": -0.31,
            "reason": "Can feel overwhelming and not relaxing."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Plans_to_Meet_New_People": [
          {
            "option": "Include",
            "score": 0.84,
            "reason": "Fun, and makes stories you two will remember."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Other_College_Friends_Join": [
          {
            "option": "Include",
            "score": -1.58,
            "reason": "Feels like a chore."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Shared_Rooms": [
          {
            "option": "Include",
            "score": 0.29,
            "reason": "The late-night chats and small moments matter."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Some_Solo_Activities": [
          {
            "option": "Include",
            "score": -0.75,
            "reason": "For you, the trip is about spending time together."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Visits_to_Nearby_Towns": [
          {
            "option": "Include",
            "score": 0.31,
            "reason": "Places like Tarragona and mountain villages sound exciting."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Hotel_Arrangements_in_the_City": [
          {
            "option": "Include",
            "score": -0.34,
            "reason": "Being near the mountains keeps nearby towns and nature views close."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Long_Nature_Excursion": [
          {
            "option": "Include",
            "score": 0,
            "reason": "Flexible on this."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "More_Historical_and_Cultural_Tours": [
          {
            "option": "Include",
            "score": 0,
            "reason": "Flexible on this."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ]
      }
    },
    {
      "role_name": "Party B",
      "narrative": "Back in college, you were close friends with your roommate, a tight two-person bond that lived and died together until graduation. You made a pact at graduation to take a trip together once your lives had gotten settled. Now five years have passed, and that trip still hasn't happened! Of course you’re both busy, but another challenge is finding a plan that feels exciting to both of you.\n\nAlthough you've stayed in touch and visit regularly, you can feel yourselves drifting apart, since you both ended up in different cities after graduating and have since formed new social circles. You think it's now or never: if you don't take this trip soon, you don't know when you’ll ever find the time. This trip is your chance to reconnect on a deep level, but will only happen if you can find a suitable plan.\n\n**The plan so far:**\nBroadly speaking, you share a lot of interests. This is why you're such great friends. Both of you love exploring, and neither of you has really traveled outside the USA. You both like cities with nightlife, but you also want the option to dip into nature when you feel like it. That mix is what you’ve been looking for. The solution? Barcelona. You’ve been talking for years about a visit to Barcelona, a culture-rich city that stays up late, with a mountain range on one side and the coast and long beaches on the other. It’s the kind of place that sparked the pact in the first place.\n\n**Issues under discussion:**\nHowever, the devil is in the details. Although you have a lot in common, you also are very different—you became roommates first by random lottery, and then friends later. For example, you love to make the most out of your day, but your roommate always somehow managed to take hours just to walk out the door on a Saturday morning.\n\nBut life is all about tradeoffs, right? You have to give a little to get a little, and you are confident that you can find a plan that works for both of you.\n\nYou’ve narrowed it down to 10 possible tweaks to the last plan. These include whether to have:\n- Slow mornings (vs early activities)\n- Multiple afternoon activities (vs just one activity)\n- Plans to meet new people (vs keeping it private)\n- Other college friends join (vs just the two of you)\n- Shared rooms (vs separate rooms)\n- Some solo activities (vs always staying together)\n- Visits to nearby towns (vs plans within the city only)\n- Hotel arrangements in the city (vs staying near the mountains)\n- A long nature excursion (vs shorter hikes only)\n- More historical tours (vs tour covering the main attractions only)\n\n*As you prepare for the negotiation, you reflect on your general preferences for each of these issues.*\n\n**Your preferences:**\nYou like fast and efficient travel. Slow mornings feel like you are giving away the best hours. Packing in a couple of activities in the afternoon makes just the day feel much more satisfying.\nMeeting new people sounds like a distraction from the point of the trip. You don’t want the weekend to revolve around socializing with strangers. If you’re spending time with anyone outside the two of you, you’d rather hang with old college friends. It’s familiar, low-pressure, and it can be genuinely fun to relive old stories for a bit.\nYou’d rather have your own room. Having private space lets you recharge, so you can show up better during the day. At the same time, you’d appreciate having some solo activities built in. Even a bit of time doing your own thing helps you reset and come back feeling fresh.\nYou don’t have strong feelings about visiting nearby towns and you're equally happy staying in the city and seeing more of it. If something is easy and you both want it, then you’re in. Hotel location is also not a big lever for you. Staying in the city or in the outskirts by the mountains both work.\nA longer nature excursion isn’t appealing to you. You’d rather avoid committing a big block of time to something outdoors-heavy. Instead, you’d enjoy doing more historical and cultural tours. There are so many guided walks, landmarks, and cultural sites to visit, but only so little time.\n\n**Your Prolific Bonus ($):**\nYour preferences are captured in the points table below. Higher points mean you like that option more, and **the total points you receive *if your group reaches an agreement* will determine the amount of money you earn from Prolific.** Since it has been five years since you and your friend lived together, your memories of each other’s travel styles may be outdated, so **maximizing your total points (and earnings) requires listening carefully and rediscovering what matters to them while still advocating for what matters most to you.**",
      "BATNA": "Your best alternative to negotiated agreement ('BATNA') is to visit your parents, which is worth 0 points.",
      "RP": 0,
      "scoresheet": {
        "Slow_Mornings": [
          {
            "option": "Include",
            "score": -1.57,
            "reason": "Slow mornings waste the best hours."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Multiple_Afternoon_Activities": [
          {
            "option": "Include",
            "score": 0.7,
            "reason": "Doing as much as possible feels satisfying."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Plans_to_Meet_New_People": [
          {
            "option": "Include",
            "score": -1.16,
            "reason": "Defeats the purpose of the trip."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Other_College_Friends_Join": [
          {
            "option": "Include",
            "score": 0.99,
            "reason": "Familiar faces, and it’s fun to relive old stories."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Shared_Rooms": [
          {
            "option": "Include",
            "score": -0.87,
            "reason": "Private space helps you recharge."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Some_Solo_Activities": [
          {
            "option": "Include",
            "score": 1.11,
            "reason": "Solo time helps you reset and come back fresh."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Visits_to_Nearby_Towns": [
          {
            "option": "Include",
            "score": 0,
            "reason": "Flexible on this."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Hotel_Arrangements_in_the_City": [
          {
            "option": "Include",
            "score": 0,
            "reason": "Flexible on this."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "Long_Nature_Excursion": [
          {
            "option": "Include",
            "score": -1.27,
            "reason": "Nature, views, and adventure doesn’t appeal; culture does."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ],
        "More_Historical_and_Cultural_Tours": [
          {
            "option": "Include",
            "score": 0.2,
            "reason": "You enjoy historical and cultural experiences."
          },
          {
            "option": "Exclude",
            "score": 0,
            "reason": ""
          }
        ]
      }
    }
  ],
  "tips": "<p class=\"text-gray-700 mb-4\">Negotiation is a skill you can get better at with practice. At its core, it is about making choices when people want different things, with each person’s decision affecting what the others get out of the deal. The good news is that a few basic ideas go a long way.</p><p class=\"text-gray-700 mb-4\">One of the most important ideas is knowing your <strong>best alternative</strong> to negotiating an agreement, or your <strong>BATNA</strong>. This is your realistic fallback plan outside the negotiation. Knowing what that alternative is <strong>actually worth</strong> helps protect you from accepting an agreement that leaves you worse off than walking away. A simple rule follows from this: <strong>never accept a deal worse than your BATNA</strong>.</p><p class=\"text-gray-700 mb-4\">Another key idea is that some negotiations can be <strong>win-win</strong>. This happens when people value different issues differently. If something matters a lot to you but not as much to the other person, you may be able to <strong>trade it for something you care about more</strong>. In practice, this means focusing less on “splitting the difference” and more on <strong>learning what the other person really wants</strong>, so you can make smart tradeoffs that leave both of you better off.</p><p class=\"text-gray-700 mb-4\">A final tip is that <strong>win-win outcomes become easier to achieve when everyone knows what matters most to each party</strong> . So try to be clear about what you care about, and how these interests translate to what you want across each issue under negotiation. At the same time, <strong>listen closely to what the other person cares about.</strong> Knowing this is what will make such smart, win-win tradeoffs possible.</p>"
}
